{
  "npcs": [
    {
      "id": "1741862919977",
      "name": "Lady Selara Astralor",
      "importance": 2,
      "appearance": "Prologue",
      "relationship": "ally",
      "category": "royal",
      "description": "An Arkan with luminous deep blue eyes and chitinous silver-white skin. Slender and graceful, Lady Selara’s warmth and empathy stand in place of martial prowess. She is betrothed to Marik Veltaris-Falkrest, offering her heartfelt support from the sidelines rather than on the battlefield. As a devoted follower of Serenya and Seraphis, her healing talents extend beyond traditional magic—she has pioneered a new method of blending Ryanite with living tissue to create bio-enhanced prosthetics.",
      "quote": "Peace is not surrender; it is the choice to heal rather than to harm, even when the world tempts you otherwise.",
      "tags": [
        "ederian",
        "nobility",
        "house-astralor"
      ],
      "imageSrc": "https://assets.legendkeeper.com/54e2cefd-58dd-4b5a-9918-169d89f337f2.png",
      "createdAt": "2025-03-13T10:48:39.977Z",
      "updatedAt": "2025-03-13T18:13:01.273Z"
    },
    {
      "id": "1741884797115",
      "name": "Raynere Falkrest, Lord of Skyhaven and Lord Paramount of House Falkrest",
      "importance": 3,
      "appearance": "Act 1, Chapter 1",
      "relationship": "ally",
      "category": "royal",
      "description": "A bronze dragonborn of 95 years, Raynere serves on the King’s Council as the Sentinel of Ederia—charged with defending the realm against monstrous and extraplanar threats. Adopted into House Falkrest after his valor in The Night of Crimson Tears, he transformed Skyhaven into a fortified bastion of security. Though stern in command, he warms any gathering with good humor once duty allows, endearing him to nobles and commoners alike.",
      "quote": "Strength is not just in battle; it’s in the choices we make to protect what we hold dear.",
      "tags": [
        "council",
        "ederian",
        "nobility",
        "paramount"
      ],
      "imageSrc": "https://assets.legendkeeper.com/b4193db1-44b9-4d7e-b72a-73e3213157be.png",
      "createdAt": "2025-03-13T16:53:17.115Z",
      "updatedAt": "2025-03-13T18:48:39.995Z"
    }
  ]
}