{
  "episodes": [
    {
      "id": "1742082863193",
      "title": "The King's Hand",
      "episodeNumber": 1,
      "dateStart": "September 1, 1103 A.R.",
      "dateEnd": "September 1, 1103 A.R.",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-1",
        "name": "Chapter 1",
        "subtitle": "The King's Hand"
      },
      "locations": [
        {
          "id": "crowns-rest",
          "name": "Crown's Rest"
        },
        {
          "id": "dragons-end",
          "name": "Dragon's End"
        },
        {
          "id": "ederia",
          "name": "Ederia"
        }
      ],
      "content": "<p>The heirs are all called to the council chambers. Edwinn arrives last and offers out gifts to all his siblings, doing his best to cut through the tension of the family’s first meeting in some time.</p><p>Eventually, King Talon and Lord Gareth arrive, ready to start the meeting. Talon greets all of his children warmly, though acknowledges that he can sense the tension between everyone.</p><p>He opens by asking about the “King’s Hand”, explaining that the Hand allows the King to be in two places at once, to strike threats but also to heal wounds. They are an extension of the king’s power and presence. Talon informs the children that the five of them will now be serving as the Hand. This seems to be in place so Talon can see how his children lead and rule.</p><p>The first task given to the heirs is to learn who is the true owner of Rosemont, as there are great disagreements amongst the residents, resulting in violence.</p><p>The group is given money for provisions to supply up before leaving the same day. Edwinn speaks with Talon about his relationship with the throne. The heirs all leave after this, heading to the market in order to buy supplies for the journey. While basic supplies are purchased, Xanthe and Cailynn gain information on the area.</p><p>The heirs meet at the gate and rendezvous with their uncle Raynere, who is excited to see them. Xanthe speaks to Raynere, opening up about wanting to know what flaws or weaknesses she has to prevent her from being named heir. Raynere is sworn to secrecy though, but on further insistence he does tell Xanthe that he also had concerns about her. Xanthe immediately left after.</p><p>Upon a night of hunting, the heirs and Raynere come across a building that was not on the map. Raynere goes to investigate, but while he does that the heirs are attacked in an ambush.</p>",
      "image": "https://i.imgur.com/oHU1p9E.png",
      "imageCaption": "Talon speaks to his firstborn son, Edwinn.",
      "createdAt": "2025-03-15T23:54:23.193Z",
      "updatedAt": "2025-03-26T19:28:16.630Z"
    },
    {
      "id": "1743020089952",
      "title": "Beneath the Bloom",
      "episodeNumber": 2,
      "dateStart": "September 1, 1103",
      "dateEnd": "September 8, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-2",
        "name": "Chapter 2",
        "subtitle": "Beneath the Bloom"
      },
      "locations": [
        {
          "id": "the-road",
          "name": "The Road"
        },
        {
          "id": "ederia",
          "name": "Ederia"
        },
        {
          "id": "rosemont",
          "name": "Rosemont"
        }
      ],
      "content": "<p>The heirs fight against the cultists and drakes, with several of them struggling as it was their first real battle. However, the tide soon turns in their favor and they are able to slay the cultists and drakes. They attempt to take one alive, but he downs a poison vial and takes his own life, leaving the heirs and Raynere alone.</p><p>Upon further investigation, Raynere declares that drakes shouldn't be here due to the cleansing that took place after the Dragon Triarchy. As Sentinel, his duty to the realm overrules his duty to protect the heirs. He takes half of the soldiers and follows the trail left behind by the cultists, hoping to find where they came from and learn more information.</p><p>The heirs all try to unwind after the battle, but Via is struck with the worst nerves. Wanting to go home and fearing for her life and those of her siblings, she attempts to try and see the future by taking Xanthe's dagger from her choosing ceremony. Upon returning to Xanthe, Via is unable to hide her emotions from her older sibling. She doesn't tell Xanthe any specifics, only offering up that there were many bad omens to be seen.</p><p>Xanthe alone now, hears something and looks around the camp, but is unable to find a source.</p><p>The heirs travel to Rosemont and meet the mayor, who offers up his own abode to the heirs while they work on the crisis. The heirs send official letters to both houses, urging them to keep their troops in check as further violence would not be tolerated. The heirs also decide to travel down to the keep that Xanthe learned about, hearing that bandits have recently taken up residency within.</p><p>Marik speaks to Xanthe and Cailynn, hoping to get them to leave Via and Edwinn out of their competition for the throne as much as possible. However, harsh words are exchanged between all three of them, and the divide only continues to grow between all the siblings as Via and Edwinn decide to officially take part in the competition as well.</p><p>The heirs travel to the keep, using Willow (Via's familiar) in order to turn into a rat and send it to spy on the keep and learn what it can. Upon reaching the lowest levels, Via is able to overhear a blue tiefling speak in vague terms about a plan that took place at King's Crown, and saying that they should avoid the Greycoats. Before more can be learned though, the tiefling sees Willow and Via magically calls him back. The bandits send out a patrol from the keep, and the heirs begin to retreat back to where they left their horses.</p>",
      "image": "https://i.imgur.com/WCJ8LDl.png",
      "imageCaption": "Raynere fights back cultists to protect Octavia",
      "createdAt": "2025-03-26T20:14:49.952Z"
    },
    {
      "id": "1743020236194",
      "title": "Besieging Bandits",
      "episodeNumber": 3,
      "dateStart": "September 8, 1103",
      "dateEnd": "September 9, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-3",
        "name": "Chapter 3",
        "subtitle": "Besieging Bandits"
      },
      "locations": [
        {
          "id": "rosemont",
          "name": "Rosemont"
        },
        {
          "id": "cerwyn-keep",
          "name": "Cerwyn Keep"
        },
        {
          "id": "ederia",
          "name": "Ederia"
        }
      ],
      "content": "<p>The session opens with Raynere and his soldiers, leading them further into the depths of the Veiled Ravine. He motions for his soldiers to stop and make camp, all of them sensing that something wasn't right.</p><p>Meanwhile, the King's Hand work to retreat from the patrol chasing them. Battle breaks out and eventually we are able to turn the tide of battle, slaying all the bandits before they can make it back. Cailynn takes some items from one of them, a key, a wanter posted of their boss, and an insignia of the Greycoats.</p><p>Back at Rosemont, the King's Hand work on a plan, deciding to have Captain Vaela lead a distraction while Marik sneaks in with one of the guards to open the gate, allowing the rest of the soldiers to storm the keep.</p><p>Before the battle, we see a flashback, seeing Talon and Kasya Astralore back in Rosemont many years ago, happy together as they see a young Bryndyn Goodbrook, the future mayor.</p><p>Eventually the battle takes place and all goes well until Veylan Rimecloak emerged with soldiers. He ends up grabbling Xanthe and holds a blade to her throat. After tense negotiation, he and his remaining soldiers are allowed to leave with 500 gold in exchange for Xanthe's safety.</p><p>While Xanthe recovers, the others move down and are able to find various records of Rosemont, notably about how the transfer of ownership would be House Draven, or the current ruling House, the Falkrest's themselves.</p><p>Another journal was from Lord Cerwyn, speaking of his friendship with The King in Crimson. However, over the years things grow more tense before Lord Cerwyn decides that the world must be saved with the king in crimson's death.</p><p>However, before anything can be taken note of, Marik stumbles through a poorly patched up part of the floor, landing in a room with draconic language and symbols. At the center: Three living dragon eggs.</p><p>Elsewhere, we see Raynere bloodied, the rest of his soldiers dead as he fights a monstrous entity.</p>",
      "image": "https://i.imgur.com/0t4MmIS.png",
      "imageCaption": "Marik and Carth fight back bandits in Cerwyn Keep",
      "createdAt": "2025-03-26T20:17:16.194Z"
    },
    {
      "id": "1743020694625",
      "title": "The Weight of Steel and Shadow",
      "episodeNumber": 4,
      "dateStart": "September 9, 1103",
      "dateEnd": "September 23, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-4",
        "name": "Chapter 4",
        "subtitle": "The Weight of Steel and Shadow"
      },
      "locations": [
        {
          "id": "ederia",
          "name": "Ederia"
        },
        {
          "id": "the-road",
          "name": "The Road"
        },
        {
          "id": "cerwyn-keep",
          "name": "Cerwyn Keep"
        },
        {
          "id": "rosemont",
          "name": "Rosemont"
        }
      ],
      "content": "<p>The council convenes back at Crown's Rest. Conversation turns to the newly appointed King's Hand and how the nobles and common folk are concerned that the group is \"set up to fail\". Talon speaks sternly to the council, reminding them to have faith in his children, as one would be the future ruler. The Spymaster stays behind and informs Talon that the Clergy has found the one they were looking for \"One of the blood\".</p><p>Meanwhile, Marik down with the dragon eggs. Before he makes any decisions he hears a voice in his mind from the emerald egg, saying that it's cold. After wrapping it up, Marik sent the egg up before retrieving the ruby egg. He leaves the third, believing there's a trap.</p><p>The King's Hand discuss what to do, some wanting to destroy them while others want to take them back to the capital. They decide to keep the eggs hidden while sending a secret letter to Talon requesting further instructions. Xanthe goes back into the room to translate the dragonic writing, bringing back several phrases that are cryptic.</p><p>Marik stays with the eggs while the rest return to Rosemont in order to settle the land dispute between House Rivermoor and House Melanth. Ultimately, we give control to House Melanth, believing that the connection House Astralor had with the throne would ensure more loyalty. House Rivermoor did not like this decision, but left without inciting further problems.</p><p>The heirs receive a sending from Talon, instructing them to take an escort and return to the capital immediately. They retrieve the last egg as well.</p><p>The next day, the Lady Paramount of House Astralor arrives to escort the King's Hand back to the capital. She requests for Xanthe (her granddaughter) to join her for a conversation on their way back.</p><p>On their way back the caravan is stopped by a group from The Church of the Cleansing Tempest, this group's sole purpose to destroy any remnants of the King in Crimson, or any traitors to the throne.</p><p>Thankfully, Cailynn is able to take the lead on negotiations, convincing them they on orders of the King they must return to the Capital immediately. Elandor Veythryn, the remnant that leads the church seems to agree and allows the group to pass, though still remains suspicious. His eyes flash with a mysterious magic, though shows no sign of detecting anything. The caravan travels on, only a day away from the Capital, and hopefully, safety.</p>",
      "image": null,
      "imageCaption": null,
      "createdAt": "2025-03-26T20:24:54.625Z"
    },
    {
      "id": "1743021045782",
      "title": "What Lives in Whispers?",
      "episodeNumber": 5,
      "dateStart": "September 23, 1103",
      "dateEnd": "September 24, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-5",
        "name": "Chapter 5",
        "subtitle": "What Lives in Whispers?"
      },
      "locations": [
        {
          "id": "crowns-rest",
          "name": "Crown's Rest"
        },
        {
          "id": "dragons-end",
          "name": "Dragon's End"
        },
        {
          "id": "manor-kings-hand",
          "name": "The Manor of the King's Hand"
        },
        {
          "id": "ederia",
          "name": "Ederia"
        }
      ],
      "content": "<p>The session opens with a flashback to about 40 years ago, with Talon returning to the Capital after being gone for many years. He is greeted by his brother Edemere and the two have an incredibly tense conversation about the future of the kingdom, as their mother is on death's door. Within the week, the queen dies and Edemere is crowned King while Talon is crowned as Lord Paramount of House Falkrest.</p><p>Jumping back to the present day, Xanthe has a tense conversation with her grandmother as they travel back to the capital. Vaelora Astralor speaks with Xanthe and tries to pry information out of her regarding The King's Hand, but Xanthe refuses to share anything. Vaelora makes veiled threats and implications about Xanthe's position in House Falkrest, but ultimately reminds Xanthe that she is on her side. The two do not speak for the remainder of the trip, with Vaelora promising to work to gain more support for Xanthe in the coming months.</p><p>Marik speaks to Captain Vaela, apologizing for the secrecy but wanting to make sure she knows how valuable her services have been after Raynere's departure.</p><p>Upon returning to the capital, the heirs and the eggs are taken to the council chambers. Each heir is questioned separately and reflects on the mission. They each pick who they believe should be the future ruler and Lord Paramount of House Falkrest. Things however become awkward as Talon concludes the meetings before speaking to Edwinn. Upon the eldest speaking up, Talon suggests that he merely forgot about Edwinn's report before allowing it to proceed. At the end, Talon asks if Edwinn would take the throne if it was asked of him. Edwinn denies it.</p><p>After this, they all gather to discuss the future of the eggs, with many of the heirs believing that they are a danger to the realm. A vote is cast, and by one vote the eggs are decided to be saved and studied. Marik also reveals that one of the eggs has spoken to him.</p><p>The eggs are placed in a pocket dimension under the care of the archmage. Selara Astralor is taking over primary study on the eggs, but everyone present in the meeting was granted unrestricted access to the eggs.</p><p>Tensions remain high amongst the King’s Hand as they are led to their new home in The Manor of the King’s Hand. They are greeted by old servants that served the crown in their youth, many of them coming out of retirement or transferring to aid the King’s Hand.</p><p>Each sibling receives a request to meet with someone important to the court. That night, Edwinn meets with the Spymaster, who opens up about the desire for the church to see Edwinn take the throne. They believe that he is divinely chosen and the god’s requests cannot be turned down. The spymaster insists that Edwinn will fight to claim the throne, or maybe of the Nornathi people that he helped will be slain as punishment. Edwinn lashes out at the building in anger after the spymaster leaves.</p><p>Later that night two guards guard one of the gates to the Capital, discussing the King’s Hand and wondering how well they’re doing in their missions. Both good and bad stories are being shared about them. However, the questioning stops as a horse comes out of the trees, worn and weary and revealing a near-dead Raynere Falkrest with ten severed heads strapped to the side of his horse. Raynere collapses off the horse as the guards call for help. An insignia of three dragon claws cut into his chest. The King’s Hand are immediately summoned, trying to figure out what took place.</p>",
      "image": "https://i.imgur.com/gRrVP4r.png",
      "imageCaption": "The Spymaster Intimidates Prince Edwinn",
      "createdAt": "2025-03-26T20:30:45.782Z",
      "updatedAt": "2025-03-26T20:42:27.410Z"
    },
    {
      "id": "1743021172683",
      "title": "Secrets & Broken Souls",
      "episodeNumber": 6,
      "dateStart": "September 24, 1103",
      "dateEnd": "September 26, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-6",
        "name": "Chapter 6",
        "subtitle": "Secrets & Broken Souls"
      },
      "locations": [
        {
          "id": "ederia",
          "name": "Ederia"
        },
        {
          "id": "crowns-rest",
          "name": "Crown's Rest"
        },
        {
          "id": "dragons-end",
          "name": "Dragon's End"
        },
        {
          "id": "manor-kings-hand",
          "name": "The Manor of the King's Hand"
        }
      ],
      "content": "<p>The King's Hand rush to the healers to find their uncle Raynere Falkrest in a great deal of pain. His jaw is busted and showing bone, and has even lost one of his arms. The magic inside his wound seems to be claiming him, and the healers ask for the heirs to reach out and try to bring him back, to give him the strength to resist. Each heir does something different, using their talents or experiences with Raynere to draw him closer, some of these techniques being more questionable than others. However, Raynere is saved, though collapses from exhaustion.</p><p>Talon soon arrives and thanks the heirs for saving his brother. He councils all official business for the next week, wanting to spend time helping Raynere recover.</p><p>Cailynn goes to visit Nan, to inform her of what happened. Nan warns Cailynn about drinking the potion she used to try and bring Raynere back, saying that whatever had a hold of Raynere likely knew of Cailynn in great detail too, and might seek her out again. Cailynn promises to be careful.</p><p>As the King's Hand goes to rest, we are treated to a flashback several years earlier. Talon is on a royal hunt with Garen Veltaris, the Lord Paramount of Kraken's Reach. They hunt together though Talon soon breaks off and encounters Garen's daughter: Sharn Veltaris. She leads the tracking and before Talon takes the shot, he offers it to her. She takes it but questions his decision, wondering if such an act would make him look weak in the eyes of others. Talon ends up inviting her to dinner, which she accepts.</p><p>In the morning Marik invites Cailynn with him to visit the dragon eggs. They enter into the pocket dimension created by the archmage and see the eggs are being protected. Marik speaks to the green egg again, learning that the dragon can choose who to speak with. The dragon starts to speak to Cailynn as they share thoughts. Marik promises to do what he can to help before voicing his concerns with the eggs.</p><p>Marik fears that the kingdom will allow fear to overrule their reasoning and end up treating the eggs terribly. He recalls his own life, saying that being stuck between two noble houses has been difficult for him growing, as he believes each parent sees the worst elements of the other within Marik. Cailynn encourages Marik that this is his time to prove to everyone who he is, that him fighting for the dragons was that first step.</p><p>Later in the day, Edwinn and Xanthe speak, reflecting on the tensions of the last mission and how the siblings' bonds seem more strained than ever. Edwinn longs for them to be a loving family again, rather than them all being loyal out of duty. He offers Xanthe a poem, though lines it by saying once she reads it that it must be destroyed. Xanthe takes the poem, uncertain of Edwinn's concerns.</p><p>Via goes to visit the archmage, who seems particularly curious about the eggs. Morgana pushes Via to explain why she isn't, causing Via to soon break down and explain that one of her visions showed the dragons causing destruction, along with five corpses nearby. Morgana apologizes for her intensity but encourages Via to continue a ritual that Via has been performing nightly since her time at the academy. Via agrees, though dislikes the idea of keeping more secrets from her family.</p><p>Meanwhile, Marik meets up with Elyndra Maelis for his requested meeting. They are near the harbor when she escorts him into the Harbor Master's office. However, Sharn Veltaris is waiting for him. Marik sits down and the two discuss the King's Hand, with her eventually questioning what took place. Marik opens up about the dragon eggs and how they are safely in the capital. Sharn encourages him to create a bond with him, believing that a prince with a dragon was hard to say no to. Marik agreed, saying that he would do his best to make her proud. Sharn soon leaves, leaving Marik along with the weight of her words.</p><p>Later that evening, Xanthe awakens Edwinn from his bed and confronts him about the poem he left. They speak cryptically, but Edwinn opens up about the spymaster threatening him and others. Xanthe promises to do all she can to help and support him, believing that they should get the others involved so they can help as well. If the spymaster is willing to harm Edwinn, then how far away is he from being willing to harm the king directly?</p><p>Cailynn goes to speak to Lord Gareth Thornefield, who openly admits to supporting her for the throne. He opens up about his own status as a bastard and believes that Cailynn would be perfect in truly unifying the Kingdom with the Serpent's Grove, allowing there to be peace for generations to come. Cailynn thanks him for his words, sensing no intent to deceive behind them.</p><p>Xanthe meets with Sir Otis, who requests for the Ederian Watch to be expanded along the roads, particularly that near the Serpent's Grove, as their have been more marauders and raiders recently. He even suggests letting several of them being out of uniform for their work, allowing them to move more freely. He also requests the money needed to train and provide the gear needed. Xanthe promises her support, though acknowledges that he will need to speak before the entirety of the King's Hand and gain their support, but she agrees to argue on his behalf as she sees the need for it.</p>",
      "image": "https://i.imgur.com/ZfzHNbv.png",
      "imageCaption": "Cailynn is Scolded by Nan for attempted to Veilwalk",
      "createdAt": "2025-03-26T20:32:52.684Z",
      "updatedAt": "2025-03-26T20:43:27.183Z"
    },
    {
      "id": "1743021272294",
      "title": "Petitions & Promises",
      "episodeNumber": 7,
      "dateStart": "September 26, 1103",
      "dateEnd": "September 27, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-7",
        "name": "Chapter 7",
        "subtitle": "Petitions & Promises"
      },
      "locations": [
        {
          "id": "crowns-rest",
          "name": "Crown's Rest"
        },
        {
          "id": "dragons-end",
          "name": "Dragon's End"
        },
        {
          "id": "manor-kings-hand",
          "name": "The Manor of the King's Hand"
        }
      ],
      "content": "<p>We open with a flashback away from the capital. Talon, Raynere and Gareth all ride together with a retinue of soldiers. They are in the Serpent's Grove but discuss the recent departure of Xanthe's mother, mentioning how the girl asks for her mother everyday and Talon doesn't have the heart to tell her that she isn't coming back.</p><p>They approach a mausoleum that is covered with draconic symbols. Talon says he saw something in a vision but this isn't right. Trolls that are \"serpent touched\" soon jump out and start to attack the king's party. Talon is ordered to retreat by Raynere but is jumped by a troll and ends up falling off a cliff and into water, passing out.</p><p>He wakes up, being taken care of by a woman: Suena. She learns that he has been recovering for two weeks, with none of her men knowing where he is. Talon reveals that this place where he's healing, and Suena herself, were the visions he saw. He believes he was supposed to meet her. and they move in to kiss.</p><p>After receiving instruction from Gareth on how to handle petitioners Xanthe goes to visit Raynere, finding Talon sitting at his side. She joins him and they talk, Talon revealing he hasn't been sleeping much as he worries that something might happen and he doesn't want to miss anything else. Talon acknowledged that Raynere was a better brother than Edemere ever was and he regrets that his relationship with Raynere wasn't doing well the past few years.</p><p>Xanthe speaks of her worry that Talon is spending too much with Raynere, as there is nothing he can do to help him. She also opens up that House Falkrest needs a new Lord Paramount as Raynere might not be able to take that position back even if he awakens. Talon asks her to stop and just pause and feel, saying they are allowed to hope and mourn in their own time. The kingdom will not fall apart in a week. Xanthe wants to debate back but seems to listen and just spend time with him.</p><p>Back at the manor, Cailynn explains that she saw something trying to take Raynere while she was veilwalking, believing that the others needed to know. She explains that she went into the ethereal plane and saw something fighting for Raynere's soul, which is not a good sign, seeing it as a dark entity that spoke.</p><p>Edwinn requests to talk to Xanthe in private. He opens up to her about wanting to tell the others about whatever secret he is hiding. He admits he doesn't want to tell Talon yet, wanting to keep it to just the siblings. Edwinn wants to confront Father Aldrin, but Xanthe dissuades him against it, believing that it would be foolish to confront him so easily. He agrees to tell the siblings after the second petitioner.</p><p>Cailynn goes up to the keep in order to speak to the clerics, to inform them of what she saw while she was veilwalking. Talon is once again there and she tells the truth in front of Talon as well. The cleric seems to believe her.</p><p>Cailynn and Talon speak, with Cailynn asking if Talon even remember what her mother sounds like, or if he's just saying that to feel better. Talon struggles, seemingly quite hurt by the implication, but says that he remembers everything about her mother, down to the very song she used to whistle while performing her magics.</p><p>Marik meanwhile, goes to the keep to have lunch with Selara Astralor. They speak of the dragons and how Marik might already be bound to the green one. They discuss their relationship, with Selara pondering if Marik should perhaps leave the throne and the politics all behind. Marik opens up about the ugly separation of his parents, explaining that he believes his family can be held together if he sits on the throne. The two continue their meal, their futures both uncertain.</p><p>Edwinn calls everyone to meet in the secure vault of the Manor. There he reveals that he has a wife and child back in the Nornathi, with his wife being the princess of the land. They have been married for thirteen years.</p><p>Edwinn goes on to explain that the spymaster has threatened their lives and requires the siblings help in order to see them reach safety. The siblings agree to help, with a tentative plan in place.</p><p>The King's Hand finally meets with the last petitioner, but upon agreeing to his requests for more Ederian Watch, he opens up about meeting with Xanthe in private and her support for his request. Many other houses join the cause, mainly heralding Xanthe as the one to see this through with Otis. With everyone dismissed, tensions grow high amongst the siblings, with many feelings betrayed while Xanthe continuing to insist she did nothing wrong. The group parts in anger, more divided than ever before.</p><p>The next day, they are called to Talon in the council chambers to learn of their next mission. They are given two missions but decide to go to Skyhaven and host a festival to find a replacement Sentinel in Raynere's absence. Edwinn points out that this will be the best opportunity for him to help his wife and daughter as well. Talon encourages the siblings to work together, remarking that Xanthe would be in charge of the festival but all decisions would require a majority vote before she could take action. He wants the siblings to bury their hatchets and grow closer, fearing that their relationship will grow as poor as his own with Edemere.</p><p>With their assignment, the heirs leave, preparing to arrange their travel to Skyhaven.</p>",
      "image": "https://i.imgur.com/lqO8RHo.png",
      "imageCaption": "Xanthe signs the petition for Ser Otis before speaking with the other heirs",
      "createdAt": "2025-03-26T20:34:32.294Z",
      "updatedAt": "2025-03-26T20:44:51.378Z"
    },
    {
      "id": "1743021379248",
      "title": "The Sea Calls",
      "episodeNumber": 8,
      "dateStart": "September 27, 1103",
      "dateEnd": "October 2, 1103",
      "act": {
        "id": "act-1",
        "name": "Act I: The Gathering Shadows",
        "subtitle": "The heirs answer their king's call"
      },
      "chapter": {
        "id": "chapter-8",
        "name": "Chapter 8",
        "subtitle": "The Sea Calls"
      },
      "locations": [
        {
          "id": "crowns-rest",
          "name": "Crown's Rest"
        },
        {
          "id": "ederia",
          "name": "Ederia"
        },
        {
          "id": "the-sea",
          "name": "The Sea"
        }
      ],
      "content": "<p>The heirs gather together in order to depart, requisitioning a Falkrest Ship to make a statement for their arrival of the tournament. They are once again rejoined by Captain Vaela and Karth from the previous mission.</p><p>After setting out to sea, Via gathers the siblings together in order to discuss some of their lingering issues. Xanthe is quick to take over the meeting with Via's permission, offering an apology for her actions during the petitions with Sir Otis. She encourages no secrets to be kept between them and inquires of everyone else's secret meeting. Everyone obliges, with the exception of Marik who doesn't believe Xanthe is sincere in her apology, saying that she's only doing this to take away any advantage the others have. Despite encouragement from the others, Marik refuses to share. The heirs part ways, though do meet up again to watch the sunset.</p><p>Before turning in, Marik and Cailynn share in a conversation discussing Xanthe and the nature of this game Talon has set them on. They discuss politics, strategy, and the thin line of trust they want to share with the other. Marik opens up to Cailynn that he saw his mother in the capital, and Cailynn warns him of what he might say around her.</p><p>The next day, Marik is training on the deck of the ship when something strange happens, compelling him to try and jump off the ship. Edwinn is unable to stop him, but thankfully Karth is able to get a hold of him. Marik has no memory of the incident, though Karth and Edwinn both heard a horrifying sound upon saving Marik. The princes order all sailors to tie lifelines to themselves and ordering all non-essential personnel below. At this time Via comes up and has a vision of dark storm clouds approaching. The heirs all meet and discuss what happened, but the ship is soon set upon by Sanguine hunters. The heirs prepare for battle, ready to defend the crew and the ship.</p><p>The battle begins, the heirs hold their own but a great number of the enemy seem very drawn to Marik. Despite several close calls, they are able to push the enemy back, but not before one last dying Sanguine utters cryptic words to Marik:</p><p>\"The song, it calls, deep deep down, the chains must be shattered by the drowned. The blood calls to the blood\"</p><p>Marik fires one last shot, executing the soldier. Before everyone leaves, Via peers into Marik's aura, seeing something.</p><p>The next day, Edwinn goes to check in on Marik, prying deeper into what's been bothering the prince lately. Marik opens up, voicing his negative feelings with the revelation of Edwinn's secret family. Marik voices his sadness, saying he would have liked to have known them and feels robbed of the last thirteen years. Edwinn defends his actions, while also criticizing Marik's silence around the King's Hand fighting. Marik respond that Edwinn's actions are not helping the group, and the brothers part way, further apart than before they started.</p><p>Marik goes to see Via, wanting to speak with her after his rough few days. He opens up to her and lets her know that despite the challenges, he will always be her older brother and he will always watch out for her. Via encourages Marik to try to be more open and closer with the rest of the family, though Marik can't bring himself to make her any promises. He merely encourages her to be safe, and that he'll always love her.</p><p>The Heirs arrive at Skyhaven, ready for their homecoming.</p><p>The session ends with a flashback to a young Raynere, seeing his earlier days of adventuring. However, the joyful tones of the day are soon stripped away as the horrors of the night descend, as we see the events of \"The Night of Crimson Tears\" a famous event when nearly the entirety of House Falkrest was wiped out. The sessions ends with Raynere finding Talon's mother protecting a young Edemere. She cries out for Talon, wondering where her son is, as the scene fades to black.</p>",
      "image": "https://i.imgur.com/GOqZvq0.png",
      "imageCaption": "Marik fights back against the sahuagin that seem drawn to him",
      "createdAt": "2025-03-26T20:36:19.248Z",
      "updatedAt": "2025-03-26T20:46:08.893Z"
    }
  ]
}